const calculateBonus = require('./debugger.js'); 

describe ("Тестирование расчета бонуса", () => {
  it ("Если сумма входных параметров больше 50, то бонус равен 50", () => {
    expect(calculateBonus(15, 50)).toBe(50);
  });
  
  it ("Если сумма входных параметров меньше 50, то бонус равен этой сумме", () => {
    expect(calculateBonus(10, 20)).toBe(30);
  });
  it ("Если сумма входных параметров равна 50, то бонус равен этой сумме", () => {
    expect(calculateBonus(30, 20)).toBe(50);
  });
  it ("Проверяем значение на 0.1 больше порогового (50)", () => {
    expect(calculateBonus(30.1, 20.0)).toBe(50);
  });
  it ("Проверяем значение на 0.1 меньше порогового (50)", () => {
    expect(calculateBonus(29.9, 20.0)).toBe(49.9);
  });
});